Repository: neoalienson/animal_chess
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, ja, ko, pt, th, zh, zh_tw

source: AI Green Player
de: KI Grün Spieler
es: Jugador Verde IA
fr: Joueur Vert IA
ja: AI 緑プレイヤー
ko: AI 녹색 플레이어
th: ผู้เล่นสีเขียว AI
zh: AI绿方玩家
zh_tw: AI綠方玩家

source: AI Red Player
de: KI Rot Spieler
es: Jugador Rojo IA
fr: Joueur Rouge IA
ja: AI 赤プレイヤー
ko: AI 빨간색 플레이어
th: ผู้เล่นสีแดง AI
zh: AI红方玩家
zh_tw: AI紅方玩家

# aiPlayersDescription
source: Enable AI players to play against the computer. You can have both players controlled by AI for demonstration purposes.
de: Aktivieren Sie KI-Spieler, um gegen den Computer zu spielen. Sie können beide Spieler von der KI steuern lassen, um eine Demonstration zu sehen.
es: Active jugadores IA para jugar contra la computadora. Puede tener a ambos jugadores controlados por IA para fines de demostración.
fr: Activez les joueurs IA pour jouer contre l'ordinateur. Vous pouvez avoir les deux joueurs contrôlés par l'IA à des fins de démonstration.
ja: AIプレイヤーを有効にしてコンピュータと対戦します。デモンストレーション目的で両方のプレイヤーをAIに制御させることができます。
ko: AI 플레이어를 활성화하여 컴퓨터와 대결하세요. 시연 목적으로 두 플레이어 모두 AI에 의해 제어되도록 할 수 있습니다.
th: เปิดใช้งานผู้เล่น AI เพื่อเล่นกับคอมพิวเตอร์ คุณสามารถมีผู้เล่นทั้งสองคนควบคุมโดย AI สำหรับวัตถุประสงค์ในการสาธิต
zh: 启用AI玩家与电脑对战。您可以设置双方都由AI控制以进行演示。
zh_tw: 啟用AI玩家與電腦對戰。您可以設置雙方都由AI控制以進行演示。
