Repository: neoalienson/animal_chess
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, ja, ko, pt, th, zh, zh_tw

source: Animal Chess
de: Tier Schach
es: Ajedrez Animal
fr: Échecs Animaux
ja: 動物チェス
ko: 동물 체스
pt: Xadrez Animal
th: หมากรุกสัตว์
zh: 斗兽棋
zh_tw: 鬥獸棋

# appTitle
source: Animal Chess (Dou Shou Qi)
de: Tier Schach (Dou Shou Qi)
es: Ajedrez Animal (Dou Shou Qi)
fr: Échecs Animaux (Dou Shou Qi)
ja: 動物チェス（鬥獸棋）
ko: 동물 체스 (Dou Shou Qi)
th: หมากรุกสัตว์ (Dou Shou Qi)
zh: 斗兽棋
zh_tw: 鬥獸棋

# appLegalese
source: Â© {year} Animal Chess
de: © {year} Tier Schach
es: © {year} Ajedrez Animal
fr: © {year} Échecs Animaux
ja: © {year} 動物チェス
ko: © {year} 동물 체스
th: © {year} หมากรุกสัตว์
zh: © {year} 斗兽棋
zh_tw: © {year} 鬥獸棋

# elephantName
source: Elephant
de: Elefant
es: Elefante
fr: Éléphant
ja: ゾウ
ko: 코끼리
th: ช้าง
zh: 象
zh_tw: 象

# lionName
source: Lion
de: Löwe
es: León
ja: ライオン
ko: 사자
th: สิงโต
zh: 狮
zh_tw: 獅

# tigerName
source: Tiger
es: Tigre
fr: Tigre
ja: トラ
ko: 호랑이
th: เสือ
zh: 虎
zh_tw: 虎

# leopardName
source: Leopard
es: Leopardo
fr: Léopard
ja: ヒョウ
ko: 표범
th: เสือดาว
zh: 豹
zh_tw: 豹

# wolfName
source: Wolf
es: Lobo
fr: Loup
ja: オオカミ
ko: 늑대
th: หมาป่า
zh: 狼
zh_tw: 狼

# dogName
source: Dog
de: Hund
es: Perro
fr: Chien
ja: イヌ
ko: 개
th: สุนัข
zh: 狗
zh_tw: 狗

# catName
source: Cat
de: Katze
es: Gato
fr: Chat
ja: ネコ
ko: 고양이
th: แมว
zh: 猫
zh_tw: 貓

# ratName
source: Rat
de: Ratte
es: Rata
ja: ネズミ
ko: 쥐
th: หนู
zh: 鼠
zh_tw: 鼠

# appDescription
source: A Flutter implementation of the classic Chinese board game Animal Chess (Dou Shou Qi).
de: Eine Flutter-Implementierung des klassischen chinesischen Brettspiels Tier Schach (Dou Shou Qi).
es: Una implementación en Flutter del clásico juego de mesa chino Ajedrez Animal (Dou Shou Qi).
fr: Une implémentation Flutter du jeu de société chinois classique Animal Chess (Dou Shou Qi).
ja: 古典的な中国のボードゲーム「動物チェス（鬥獸棋）」のFlutter実装。
ko: 고전 중국 보드 게임 동물 체스(鬥獸棋)의 Flutter 구현.
pt: Uma implementação Flutter do clássico jogo de tabuleiro chinês Xadrez Animal (Dou Shou Qi).
th: การนำเกมหมากรุกสัตว์ (鬥獸棋) แบบจีนคลาสสิกมาใช้ใน Flutter
zh: 经典中国棋盘游戏斗兽棋的Flutter实现。
zh_tw: 經典中國棋盤遊戲鬥獸棋的Flutter實現。

source: New Game
de: Neues Spiel
es: Nuevo juego
fr: Nouvelle partie
ja: 新しいゲーム
ko: 새 게임
pt: Novo Jogo
th: เกมใหม่
zh: 新游戏
zh_tw: 新遊戲

source: Game Instructions
de: Spielanleitung
es: Instrucciones del juego
fr: Instructions du jeu
ja: ゲームの遊び方
ko: 게임 방법
pt: Instruções do Jogo
th: คำแนะนำเกม
zh: 游戏说明
zh_tw: 遊戲說明

source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
ja: 設定
ko: 설정
pt: Configurações
th: การตั้งค่า
zh: 设置
zh_tw: 設定

source: Language
de: Sprache
es: Idioma
fr: Langue
ja: 言語
ko: 언어
pt: Idioma
th: ภาษา
zh: 语言
zh_tw: 語言

source: About
de: Über
es: Acerca de
fr: À propos
ja: について
ko: 정보
pt: Sobre
th: เกี่ยวกับ
zh: 关于
zh_tw: 關於

source: Select Language
de: Sprache auswählen
es: Seleccionar idioma
fr: Sélectionner la langue
ja: 言語選択
ko: 언어 선택
pt: Selecionar Idioma
th: เลือกภาษา
zh: 选择语言
zh_tw: 選擇語言

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt: Cancelar
th: ยกเลิก
zh: 取消
zh_tw: 取消

source: Game Rules
de: Spielregeln
es: Reglas del juego
fr: Règles du jeu
ja: ゲームルール
ko: 게임 규칙
pt: Regras do Jogo
th: กฎของเกม
zh: 游戏规则
zh_tw: 遊戲規則

source: Game Variants
de: Spielvarianten
es: Variantes del juego
fr: Variantes du jeu
ja: ゲームバリアント
ko: 게임 변형
pt: Variantes do Jogo
th: รูปแบบเกม
zh: 游戏变体
zh_tw: 遊戲變體

source: Reset Game
de: Spiel zurücksetzen
es: Reiniciar juego
fr: Réinitialiser le jeu
ja: ゲームをリセット
ko: 게임 재설정
pt: Reiniciar Jogo
th: รีเซ็ตเกม
zh: 重置游戏
zh_tw: 重置遊戲

source: Green Player
de: Grüner Spieler
es: Jugador Verde
fr: Joueur Vert
ja: 緑のプレイヤー
ko: 녹색 플레이어
pt: Jogador Verde
th: ผู้เล่นสีเขียว
zh: 绿方玩家
zh_tw: 綠方玩家

source: Red Player
de: Roter Spieler
es: Jugador Rojo
fr: Joueur Rouge
ja: 赤のプレイヤー
ko: 빨간색 플레이어
pt: Jogador Vermelho
th: ผู้เล่นสีแดง
zh: 红方玩家
zh_tw: 紅方玩家

# gameOverWins
source: Game Over! {player} wins!
de: Spiel vorbei! {player} gewinnt!
es: ¡Juego terminado! ¡{player} gana!
fr: Partie terminée ! {player} gagne !
ja: ゲームオーバー！{player}の勝ち！
ko: 게임 종료! {player} 승리!
pt: Fim de jogo! {player} vence!
th: จบเกม! {player} ชนะ!
zh: 游戏结束！{player}获胜！
zh_tw: 遊戲結束！{player}獲勝！

# gameOverDraw
source: Game Over! It's a draw!
de: Spiel vorbei! Unentschieden!
es: ¡Juego terminado! ¡Es un empate!
fr: Partie terminée ! Match nul !
ja: ゲームオーバー！引き分け！
ko: 게임 종료! 무승부!
pt: Fim de jogo! É um empate!
th: จบเกม! เสมอ!
zh: 游戏结束！平局！
zh_tw: 遊戲結束！平局！

# turn
source: {player}'s turn
de: {player} ist am Zug
es: Turno de {player}
fr: Tour de {player}
ja: {player}のターン
ko: {player}의 차례
pt: Vez de {player}
th: ตาของ {player}
zh: {player}的回合
zh_tw: {player}的回合

# gameRule1
source: Each player commands 8 animals with different ranks.
de: Jeder Spieler befehligt 8 Tiere mit unterschiedlichen Rängen.
es: Cada jugador comanda 8 animales con diferentes rangos.
fr: Chaque joueur commande 8 animaux de rangs différents.
ja: 各プレイヤーは異なるランクの8匹の動物を指揮します。
ko: 각 플레이어는 다른 등급의 동물 8마리를 지휘합니다.
pt: Cada jogador comanda 8 animais com diferentes patentes.
th: ผู้เล่นแต่ละคนควบคุมสัตว์ 8 ตัวที่มีอันดับต่างกัน
zh: 每位玩家指挥8只不同等级的动物。
zh_tw: 每位玩家指揮8隻不同等級的動物。

# gameRule2
source: Objective: Move any piece into opponent's den or capture all opponent pieces.
de: Ziel: Eine Figur in die Höhle des Gegners bewegen oder alle gegnerischen Figuren schlagen.
es: Objetivo: Mover cualquier pieza al den del oponente o capturar todas las piezas del oponente.
fr: Objectif: Déplacer une pièce dans le repaire de l'adversaire ou capturer toutes les pièces adverses.
ja: 目的：相手の巣穴に駒を進めるか、相手の駒をすべて捕獲する。
ko: 목표: 상대방의 굴에 말을 이동시키거나 상대방의 말을 모두 잡는 것입니다.
pt: Objetivo: Mover qualquer peça para a toca do oponente ou capturar todas as peças do oponente.
th: วัตถุประสงค์: ย้ายหมากตัวใดตัวหนึ่งเข้าไปในรังของคู่ต่อสู้ หรือจับหมากของคู่ต่อสู้ทั้งหมด
zh: 目标：将任何棋子移入对方兽穴或捕获所有对方棋子。
zh_tw: 目標：將任何棋子移入對方獸穴或捕獲所有對方棋子。

# gameRule3
source: Pieces move one space orthogonally (up, down, left, or right).
de: Figuren bewegen sich ein Feld orthogonal (hoch, runter, links oder rechts).
es: Las piezas se mueven una casilla ortogonalmente (arriba, abajo, izquierda o derecha).
fr: Les pièces se déplacent d'une case orthogonalement (haut, bas, gauche ou droite).
ja: 駒は縦横に1マス移動します。
ko: 말은 상하좌우로 한 칸씩 움직입니다.
pt: As peças movem-se uma casa ortogonalmente (para cima, para baixo, para a esquerda ou para a direita).
th: หมากเคลื่อนที่ได้หนึ่งช่องในแนวตั้ง (ขึ้น, ลง, ซ้าย, หรือขวา)
zh: 棋子可向上、下、左、右移动一格。
zh_tw: 棋子可向上、下、左、右移動一格。

# gameRule4
source: Only the Rat can enter the river.
de: Nur die Ratte darf den Fluss betreten.
es: Solo la Rata puede entrar al río.
fr: Seul le Rat peut entrer dans la rivière.
ja: ネズミだけが川に入ることができます。
ko: 쥐만 강에 들어갈 수 있습니다.
pt: Apenas o Rato pode entrar no rio.
th: หนูเท่านั้นที่สามารถลงแม่น้ำได้
zh: 只有老鼠可以进入河流。
zh_tw: 只有老鼠可以進入河流。

# gameRule5
source: Lion and Tiger can jump over rivers.
de: Löwe und Tiger können über beide Flüsse springen.
es: El León y el Tigre pueden saltar sobre ambos ríos.
fr: Le Lion et le Tigre peuvent sauter par-dessus les rivières.
ja: ライオンとトラは川を飛び越えることができます。
ko: 사자와 호랑이는 강을 뛰어넘을 수 있습니다.
pt: O Leão e o Tigre podem saltar sobre ambos os rios.
th: สิงโตและเสือสามารถกระโดดข้ามแม่น้ำได้
zh: 狮子和老虎可以跳过两条河流。
zh_tw: 獅子和老虎可以跳過河流。

# gameRule6
source: Pieces in traps can be captured by any opponent piece.
de: Figuren in Fallen können von jeder gegnerischen Figur geschlagen werden.
es: Las piezas en trampas pueden ser capturadas por cualquier pieza oponente.
fr: Les pièces dans les pièges peuvent être capturées par n'importe quelle pièce adverse.
ja: 罠の中の駒は、相手のどの駒でも捕獲できます。
ko: 덫에 갇힌 말은 상대방의 어떤 말이라도 잡을 수 있습니다.
pt: Peças em armadilhas podem ser capturadas por qualquer peça adversária.
th: หมากในกับดักสามารถถูกจับได้โดยหมากของคู่ต่อสู้
zh: 在陷阱中的棋子可被任何对手棋子捕获。
zh_tw: 在陷阱中的棋子可被任何對手棋子捕獲。

# gameRule7
source: A piece can capture an opponent's piece if it is of equal or lower rank.
de: Eine Figur kann eine gegnerische Figur schlagen, wenn sie gleich oder niedriger im Rang ist.
es: Una pieza puede capturar una pieza del oponente si es de rango igual o inferior.
fr: Une pièce peut capturer une pièce adverse si elle est de rang égal ou inférieur.
ja: 駒は、同等またはそれ以下のランクの相手の駒を捕獲できます。
ko: 말은 자신과 같거나 낮은 등급의 상대방 말을 잡을 수 있습니다.
pt: Uma peça pode capturar uma peça do oponente se for de patente igual ou inferior.
th: หมากสามารถจับหมากของคู่ต่อสู้ได้หากมีอันดับเท่ากันหรือต่ำกว่า
zh: 棋子可以捕获等级相同或较低的对手棋子。
zh_tw: 棋子可以捕獲等級相同或較低的對手棋子。

# gameRule8
source: Exception: Rat can capture Elephant, and Elephant can capture Rat.
de: Ausnahme: Ratte kann Elefant schlagen, und Elefant kann Ratte schlagen.
es: Excepción: La rata puede capturar al elefante, y el elefante puede capturar a la rata.
fr: Exception: Le rat peut capturer l'éléphant, et l'éléphant peut capturer le rat.
ja: 例外：ネズミはゾウを捕獲でき、ゾウはネズミを捕獲できます。
ko: 예외: 쥐는 코끼리를 잡을 수 있고, 코끼리는 쥐를 잡을 수 있습니다.
pt: Exceção: O Rato pode capturar o Elefante, e o Elefante pode capturar o Rato.
th: ข้อยกเว้น: หนูจับช้างได้ และช้างจับหนูได้
zh: 例外：老鼠可以捕获大象，大象可以捕获老鼠。
zh_tw: 例外：老鼠可以捕獲大象，大象可以捕獲老鼠。

source: Close
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
pt: Fechar
th: ปิด
zh: 关闭
zh_tw: 關閉

source: Rat-Only Den Entry
de: Nur Ratten dürfen den Bau betreten
es: Entrada a la guarida solo para ratas
fr: Entrée de la tanière réservée aux rats
ja: ネズミのみの巣穴侵入
ko: 쥐만 굴에 들어갈 수 있음
pt: Entrada da toca apenas para Rato
th: หนูเท่านั้นที่เข้าถ้ำได้
zh: 只有老鼠可以进入兽穴
zh_tw: 只有老鼠可以進入獸穴

source: Extended Lion/Tiger Jumps
de: Erweiterte Löwen-/Tiger-Sprünge
es: Saltos extendidos de León/Tigre
fr: Sauts étendus Lion/Tigre
ja: 拡張ライオン/トラのジャンプ
ko: 확장된 사자/호랑이 점프
pt: Saltos Estendidos de Leão/Tigre
th: การกระโดดของสิงโต/เสือที่ขยายออกไป
zh: 狮虎跳跃扩展
zh_tw: 獅虎跳躍擴展

source: Dog River Variant
de: Hund-Fluss-Variante
es: Variante del río Perro
fr: Variante de la rivière du chien
ja: 犬の川のバリアント
ko: 개 강 변형
pt: Variante do Rio Cão
th: รูปแบบแม่น้ำสุนัข
zh: 狗入河变体
zh_tw: 狗入河變體

source: Rat cannot capture Elephant
de: Ratte kann Elefant nicht schlagen
es: La rata no puede capturar al elefante
fr: Le rat ne peut pas capturer l'éléphant
ja: ネズミはゾウを捕獲できません
ko: 쥐는 코끼리를 잡을 수 없습니다
pt: Rato não pode capturar Elefante
th: หนูจับช้างไม่ได้
zh: 老鼠不能捕获大象
zh_tw: 老鼠不能捕獲大象

# variantRatOnlyDenEntry
source: Only the Rat can enter the opponent's den to win
de: Nur die Ratte darf den Bau des Gegners betreten, um zu gewinnen
es: Solo la Rata puede entrar en la guarida del oponente para ganar
fr: Seul le Rat peut entrer dans la tanière de l'adversaire pour gagner
ja: ネズミだけが相手の巣穴に入って勝つことができます
ko: 쥐만 상대방의 굴에 들어가 승리할 수 있습니다
pt: Apenas o Rato pode entrar na toca do oponente para vencer
th: หนูเท่านั้นที่สามารถเข้าถ้ำของคู่ต่อสู้เพื่อชนะได้
zh: 只有老鼠可以进入对手兽穴获胜
zh_tw: 只有老鼠可以進入對手獸穴獲勝

# variantExtendedLionTigerJumps
source: Extended Lion/Tiger Jumps:
de: Erweiterte Löwen-/Tiger-Sprünge:
es: Saltos extendidos de León/Tigre:
fr: Sauts étendus Lion/Tigre:
ja: 拡張ライオン/トラのジャンプ：
ko: 확장된 사자/호랑이 점프:
pt: Saltos Estendidos de Leão/Tigre:
th: การกระโดดของสิงโต/เสือที่ขยายออกไป:
zh: 狮虎跳跃扩展：
zh_tw: 獅虎跳躍擴展：

# variantLionJumpBothRivers
source: Lion can jump over both rivers
de: Löwe kann über beide Flüsse springen
es: El León puede saltar sobre ambos ríos
fr: Le Lion peut sauter par-dessus les deux rivières
ja: ライオンは両方の川を飛び越えることができます
ko: 사자는 두 강을 모두 뛰어넘을 수 있습니다
pt: O Leão pode saltar sobre ambos os rios
th: สิงโตสามารถกระโดดข้ามแม่น้ำทั้งสองได้
zh: 狮子可以跳过两条河流
zh_tw: 獅子可以跳過兩條河流

# variantTigerJumpSingleRiver
source: Tiger can jump over a single river
de: Tiger kann über einen einzelnen Fluss springen
es: El Tigre puede saltar sobre un solo río
fr: Le Tigre peut sauter par-dessus une seule rivière
ja: トラは単一の川を飛び越えることができます
ko: 호랑이는 단일 강을 뛰어넘을 수 있습니다
pt: O Tigre pode saltar sobre um único rio
th: เสือสามารถกระโดดข้ามแม่น้ำสายเดียวได้
zh: 老虎可以跳过一条河流
zh_tw: 老虎可以跳過一條河流

# variantLeopardCrossRivers
source: Leopard can cross rivers horizontally
de: Leopard kann Flüsse horizontal überqueren
es: El Leopardo puede cruzar ríos horizontalmente
fr: Le Léopard peut traverser les rivières horizontalement
ja: ヒョウは川を水平に渡ることができます
ko: 표범은 강을 수평으로 건널 수 있습니다
pt: O Leopardo pode atravessar rios horizontalmente
th: เสือดาวสามารถข้ามแม่น้ำในแนวนอนได้
zh: 豹可以横向过河
zh_tw: 豹可以橫向過河

# variantDogRiver
source: Dog River Variant:
de: Hund-Fluss-Variante:
es: Variante del río Perro:
fr: Variante de la rivière du chien:
ja: 犬の川のバリアント：
ko: 개 강 변형:
pt: Variante do Rio Cão:
th: รูปแบบแม่น้ำสุนัข:
zh: 狗入河变体：
zh_tw: 狗入河變體：

# variantDogEnterRiver
source: Dog can enter the river
de: Hund kann den Fluss betreten.
es: El Perro puede entrar al río.
fr: Le Chien peut entrer dans la rivière.
ja: 犬は川に入ることができます。
ko: 개는 강에 들어갈 수 있습니다.
pt: O Cão pode entrar no rio.
th: สุนัขสามารถลงแม่น้ำได้
zh: 狗可以进入河流。
zh_tw: 狗可以進入河流。

# variantDogCaptureFromRiver
source: Only the Dog can capture pieces on the shore from within the river
de: Nur der Hund kann Figuren am Ufer vom Fluss aus schlagen
es: Solo el Perro puede capturar piezas en la orilla desde dentro del río
fr: Seul le Chien peut capturer des pièces sur le rivage depuis la rivière
ja: 犬だけが川の中から岸の駒を捕獲できます
ko: 개만이 강에서 해안의 말을 잡을 수 있습니다
pt: Apenas o Cão pode capturar peças na margem a partir do rio
th: สุนัขเท่านั้นที่สามารถจับหมากบนฝั่งจากในแม่น้ำได้
zh: 只有狗可以在河中捕获岸上的棋子
zh_tw: 只有狗可以在河中捕獲岸上的棋子

# variantRatCannotCaptureElephant
source: In standard rules, the Rat can capture the Elephant. Enable this variant to remove this exception.
de: In den Standardregeln kann die Ratte den Elefanten schlagen. Aktivieren Sie diese Variante, um diese Ausnahme zu entfernen.
es: En las reglas estándar, la Rata puede capturar al Elefante. Active esta variante para eliminar esta excepción.
fr: Dans les règles standard, le rat peut capturer l'éléphant. Activez cette variante pour supprimer cette exception.
ja: 標準ルールでは、ネズミはゾウを捕獲できます。この例外を削除するには、このバリアントを有効にしてください。
ko: 표준 규칙에서 쥐는 코끼리를 잡을 수 있습니다. 이 예외를 제거하려면 이 변형을 활성화하세요.
th: ตามกฎมาตรฐาน หนูจับช้างได้ เปิดใช้งานตัวแปรนี้เพื่อลบข้อยกเว้นนี้ออก
zh: 在标准规则中，老鼠可以捕获大象。启用此变体以移除此例外。
zh_tw: 在標準規則中，老鼠可以捕獲大象。啟用此變體以移除此例外。

# variantRatOnlyDenEntryDescriptionEnabled
source: With this variant enabled, only the Rat can enter the opponent's den to win the game. In standard rules, any piece can enter the den.
de: Wenn diese Variante aktiviert ist, darf nur die Ratte den Bau des Gegners betreten, um zu gewinnen. In den Standardregeln darf jede Figur den Bau betreten.
es: Con esta variante activada, solo la Rata puede entrar en la guarida del oponente para ganar el juego. En las reglas estándar, cualquier pieza puede entrar en la guarida.
fr: Avec cette variante activée, seul le Rat peut entrer dans la tanière de l'adversaire pour gagner la partie. Dans les règles standard, n'importe quelle pièce peut entrer dans la tanière.
ja: このバリアントが有効になっている場合、ネズミだけが相手の巣穴に入ってゲームに勝つことができます。標準ルールでは、どの駒でも巣穴に入ることができます。
ko: 이 변형이 활성화되면 쥐만 상대방의 굴에 들어가 게임에서 승리할 수 있습니다. 표준 규칙에서는 어떤 말도 굴에 들어갈 수 있습니다.
th: เมื่อเปิดใช้งานตัวแปรนี้ หนูเท่านั้นที่สามารถเข้าถ้ำของคู่ต่อสู้เพื่อชนะเกมได้ ตามกฎมาตรฐาน หมากตัวใดก็ตามสามารถเข้าถ้ำได้
zh: 启用此变体后，只有老鼠可以进入对方兽穴获胜。在标准规则中，任何棋子都可以进入兽穴。
zh_tw: 啟用此變體後，只有老鼠可以進入對方獸穴獲勝。在標準規則中，任何棋子都可以進入獸穴。

# variantRatOnlyDenEntryDescriptionDisabled
source: In standard rules, any piece can enter the opponent's den to win the game. Enable this variant to restrict den entry to only the Rat.
de: In den Standardregeln darf jede Figur den Bau des Gegners betreten, um zu gewinnen. Aktivieren Sie diese Variante, um den Bau-Eintritt auf die Ratte zu beschränken.
es: En las reglas estándar, cualquier pieza puede entrar en la guarida del oponente para ganar el juego. Active esta variante para restringir la entrada a la guarida solo a la Rata.
fr: Dans les règles standard, n'importe quelle pièce peut entrer dans la tanière de l'adversaire pour gagner la partie. Activez cette variante pour restreindre l'entrée dans la tanière au Rat uniquement.
ja: 標準ルールでは、どの駒でも相手の巣穴に入ってゲームに勝つことができます。巣穴への進入をネズミのみに制限するには、このバリアントを有効にしてください。
ko: 표준 규칙에서는 어떤 말도 상대방의 굴에 들어가 게임에서 승리할 수 있습니다. 굴 진입을 쥐만으로 제한하려면 이 변형을 활성화하세요.
th: ตามกฎมาตรฐาน หมากตัวใดก็ตามสามารถเข้าถ้ำของคู่ต่อสู้เพื่อชนะเกมได้ เปิดใช้งานตัวแปรนี้เพื่อจำกัดการเข้าถ้ำให้เฉพาะหนูเท่านั้น
zh: 在标准规则中，任何棋子都可以进入对方兽穴获胜。启用此变体以限制只有老鼠可以进入兽穴。
zh_tw: 在標準規則中，任何棋子都可以進入對方獸穴獲勝。啟用此變體以限制只有老鼠可以進入獸穴。

# variantExtendedLionTigerJumpsDescriptionEnabled
source: This variant extends the jumping abilities of Lion, Tiger, and Leopard beyond the standard rules.
de: Diese Variante erweitert die Sprungfähigkeiten von Löwe, Tiger und Leopard über die Standardregeln hinaus.
es: Esta variante extiende las habilidades de salto del León, Tigre y Leopardo más allá de las reglas estándar.
fr: Cette variante étend les capacités de saut du Lion, du Tigre et du Léopard au-delà des règles standard.
ja: このバリアントは、ライオン、トラ、ヒョウのジャンプ能力を標準ルールを超えて拡張します。
ko: 이 변형은 사자, 호랑이, 표범의 점프 능력을 표준 규칙을 넘어 확장합니다.
th: ตัวแปรนี้ขยายความสามารถในการกระโดดของสิงโต เสือ และเสือดาวให้เกินกว่ากฎมาตรฐาน
zh: 此变体扩展了狮子、老虎和豹子的跳跃能力，超越了标准规则。
zh_tw: 此變體擴展了獅子、老虎和豹子的跳躍能力，超越了標準規則。

# variantExtendedLionTigerJumpsDescriptionDisabled
source: In standard rules, Lion and Tiger can jump over rivers. This variant adds additional jumping capabilities when enabled.
de: In den Standardregeln können Löwe und Tiger über Flüsse springen. Diese Variante fügt zusätzliche Sprungfähigkeiten hinzu, wenn sie aktiviert ist.
es: En las reglas estándar, el León y el Tigre pueden saltar sobre ríos. Esta variante añade capacidades de salto adicionales cuando se activa.
fr: Dans les règles standard, le Lion et le Tigre peuvent sauter par-dessus les rivières. Cette variante ajoute des capacités de saut supplémentaires lorsqu'elle est activée.
ja: 標準ルールでは、ライオンとトラは川を飛び越えることができます。このバリアントは、有効にすると追加のジャンプ能力を追加します。
ko: 표준 규칙에서 사자와 호랑이는 강을 뛰어넘을 수 있습니다. 이 변형은 활성화되면 추가 점프 능력을 추가합니다.
th: ตามกฎมาตรฐาน สิงโตและเสือสามารถกระโดดข้ามแม่น้ำได้ ตัวแปรนี้เพิ่มความสามารถในการกระโดดเพิ่มเติมเมื่อเปิดใช้งาน
zh: 在标准规则中，狮子和老虎可以跳过河流。启用此变体时会增加额外的跳跃能力。
zh_tw: 在標準規則中，獅子和老虎可以跳過河流。啟用此變體時會增加額外的跳躍能力。

# variantLionJumpStandard
source: Lion can jump over a single river (standard rule)
de: Löwe kann über einen einzelnen Fluss springen (Standardregel)
es: El León puede saltar sobre un solo río (regla estándar)
fr: Le Lion peut sauter par-dessus une seule rivière (règle standard)
ja: ライオンは単一の川を飛び越えることができます（標準ルール）
ko: 사자는 단일 강을 뛰어넘을 수 있습니다 (표준 규칙)
th: สิงโตสามารถกระโดดข้ามแม่น้ำสายเดียวได้ (กฎมาตรฐาน)
zh: 狮子可以跳过一条河流（标准规则）
zh_tw: 獅子可以跳過一條河流（標準規則）

# variantTigerJumpStandard
source: Tiger can jump over a single river (standard rule)
de: Tiger kann über einen einzelnen Fluss springen (Standardregel)
es: El Tigre puede saltar sobre un solo río (regla estándar)
fr: Le Tigre peut sauter par-dessus une seule rivière (règle standard)
ja: トラは単一の川を飛び越えることができます（標準ルール）
ko: 호랑이는 단일 강을 뛰어넘을 수 있습니다 (표준 규칙)
th: เสือสามารถกระโดดข้ามแม่น้ำสายเดียวได้ (กฎมาตรฐาน)
zh: 老虎可以跳过一条河流（标准规则）
zh_tw: 老虎可以跳過一條河流（標準規則）

# variantLeopardCrossRiversStandard
source: Leopard cannot cross rivers (standard rule)
de: Leopard kann keine Flüsse überqueren (Standardregel)
es: El Leopardo no puede cruzar ríos (regla estándar)
fr: Le Léopard ne peut pas traverser les rivières (règle standard)
ja: ヒョウは川を渡ることができません（標準ルール）
ko: 표범은 강을 건널 수 없습니다 (표준 규칙)
th: เสือดาวไม่สามารถข้ามแม่น้ำได้ (กฎมาตรฐาน)
zh: 豹子不能过河（标准规则）
zh_tw: 豹子不能過河（標準規則）

# variantDogRiverDescriptionEnabled
source: This variant gives the Dog special river abilities that are not available in standard rules.
de: Diese Variante verleiht dem Hund besondere Flussfähigkeiten, die in den Standardregeln nicht verfügbar sind.
es: Esta variante otorga al Perro habilidades especiales en el río que no están disponibles en las reglas estándar.
fr: Cette variante donne au Chien des capacités spéciales dans la rivière qui ne sont pas disponibles dans les règles standard.
ja: このバリアントは、標準ルールでは利用できない犬の特別な川の能力を付与します。
ko: 이 변형은 표준 규칙에서는 사용할 수 없는 개의 특별한 강 능력을 부여합니다.
th: ตัวแปรนี้มอบความสามารถพิเศษในแม่น้ำให้กับสุนัขซึ่งไม่มีในกฎมาตรฐาน
zh: 此变体赋予狗在河流中的特殊能力，这在标准规则中是不可用的。
zh_tw: 此變體賦予狗在河流中的特殊能力，這在標準規則中是不可用的。

# variantDogRiverDescriptionDisabled
source: In standard rules, only the Rat can enter the river. This variant gives the Dog special river abilities when enabled.
de: In den Standardregeln darf nur die Ratte den Fluss betreten. Diese Variante verleiht dem Hund besondere Flussfähigkeiten, wenn sie aktiviert ist.
es: En las reglas estándar, solo la Rata puede entrar al río. Esta variante otorga al Perro habilidades especiales en el río cuando se activa.
fr: Dans les règles standard, seul le Rat peut entrer dans la rivière. Cette variante donne au Chien des capacités spéciales dans la rivière lorsqu'elle est activée.
ja: 標準ルールでは、ネズミだけが川に入ることができます。このバリアントは、有効にすると犬に特別な川の能力を付与します。
ko: 표준 규칙에서는 쥐만 강에 들어갈 수 있습니다. 이 변형은 활성화되면 개에게 특별한 강 능력을 부여합니다.
th: ตามกฎมาตรฐาน หนูเท่านั้นที่สามารถลงแม่น้ำได้ ตัวแปรนี้มอบความสามารถพิเศษในแม่น้ำให้กับสุนัขเมื่อเปิดใช้งาน
zh: 在标准规则中，只有老鼠可以进入河流。此变体在启用时赋予狗特殊的河流能力。
zh_tw: 在標準規則中，只有老鼠可以進入河流。此變體在啟用時賦予狗特殊的河流能力。

# variantRatCannotCaptureElephantDescriptionEnabled
source: With this variant enabled, the Rat cannot capture the Elephant. In standard rules, the Rat can capture the Elephant (exception to the normal rank hierarchy).
de: Wenn diese Variante aktiviert ist, kann die Ratte den Elefanten nicht schlagen. In den Standardregeln kann die Ratte den Elefanten schlagen (Ausnahme in der normalen Rangfolge).
es: Con esta variante activada, la Rata no puede capturar al Elefante. En las reglas estándar, la Rata puede capturar al Elefante (excepción a la jerarquía normal de rangos).
fr: Avec cette variante activée, le Rat ne peut pas capturer l'Éléphant. Dans les règles standard, le Rat peut capturer l'Éléphant (exception à la hiérarchie normale des rangs).
ja: このバリアントが有効になっている場合、ネズミはゾウを捕獲できません。標準ルールでは、ネズミはゾウを捕獲できます（通常のランク階層の例外）。
ko: 이 변형이 활성화되면 쥐는 코끼리를 잡을 수 없습니다. 표준 규칙에서는 쥐가 코끼리를 잡을 수 있습니다 (일반 등급 계층의 예외).
th: เมื่อเปิดใช้งานตัวแปรนี้ หนูจับช้างไม่ได้ ตามกฎมาตรฐาน หนูจับช้างได้ (ข้อยกเว้นจากระดับปกติ)
zh: 启用此变体后，老鼠不能捕获大象。在标准规则中，老鼠可以捕获大象（等级层次结构的例外）。
zh_tw: 啟用此變體後，老鼠不能捕獲大象。在標準規則中，老鼠可以捕獲大象（等級層次結構的例外）。

# variantRatCannotCaptureElephantDescriptionDisabled
source: In standard rules, the Rat can capture the Elephant (exception to the normal rank hierarchy). Enable this variant to remove this exception.
de: In den Standardregeln kann die Ratte den Elefanten schlagen (Ausnahme in der normalen Rangfolge). Aktivieren Sie diese Variante, um diese Ausnahme zu entfernen.
es: En las reglas estándar, la Rata puede capturar al Elefante (excepción a la jerarquía normal de rangos). Active esta variante para eliminar esta excepción.
fr: Dans les règles standard, le Rat peut capturer l'Éléphant (exception à la hiérarchie normale des rangs). Activez cette variante pour supprimer cette exception.
ja: 標準ルールでは、ネズミはゾウを捕獲できます（通常のランク階層の例外）。この例外を削除するには、このバリアントを有効にしてください。
ko: 표준 규칙에서는 쥐가 코끼리를 잡을 수 있습니다 (일반 등급 계층의 예외). 이 예외를 제거하려면 이 변형을 활성화하세요.
th: ตามกฎมาตรฐาน หนูจับช้างได้ (ข้อยกเว้นจากระดับปกติ) เปิดใช้งานตัวแปรนี้เพื่อลบข้อยกเว้นนี้ออก
zh: 在标准规则中，老鼠可以捕获大象（等级层次结构的例外）。启用此变体以移除此例外。
zh_tw: 在標準規則中，老鼠可以捕獲大象（等級層次結構的例外）。啟用此變體以移除此例外。

source: Pieces Rank
de: Figurenrang
es: Rango de Piezas
fr: Rang des pièces
ja: 駒のランク
ko: 기물 순위
pt: Patente das peças
th: อันดับของหมาก
zh: 棋子等级
zh_tw: 棋子等級

# piecesRankListTitle
source: Pieces Rank
de: Figurenrang
es: Rango de Piezas
fr: Rang des pièces
ja: 駒のランク
ko: 기물 순위
th: อันดับของหมาก
zh: 棋子等级
zh_tw: 棋子等級

source: Save
zh: 保存
zh_tw: 儲存

source: Piece Display Format
zh: 棋子显示格式
zh_tw: 棋子顯示格式

# displayFormatEmoji
source: Emoji
zh: 表情符号
zh_tw: 表情符號

# displayFormatSimplifiedChinese
source: Simplified Chinese
zh: 简体中文
zh_tw: 簡體中文

# displayFormatTraditionalChinese
source: Traditional Chinese
zh: 繁体中文
zh_tw: 繁體中文

source: Enabled
zh: 已启用
zh_tw: 已啟用

source: Disabled
zh: 已禁用
zh_tw: 已禁用

source: AI Players
de: KI-Spieler
es: Jugadores IA
fr: Joueurs IA
ja: AIプレイヤー
ko: AI 플레이어
th: ผู้เล่น AI
zh: AI玩家
zh_tw: AI玩家
